In [1]:
import pandas as pd
import numpy as np

# pandas series

In [2]:
series = pd.Series([1,2,3,4], index=[1.1,1.2,1.3,1.4])

In [3]:
series

1.1    1
1.2    2
1.3    3
1.4    4
dtype: int64

In [4]:
arr = np.array([1,2,3,4])
arr2 = np.array(['a','b','c','d'])

In [6]:
series2 = pd.Series(arr, index= arr2)

In [7]:
series2

a    1
b    2
c    3
d    4
dtype: int32

In [10]:
apples = pd.Series([2,3,2,1,4])
oranges = pd.Series([1,2,2,3,2])
apples.name = 'apples'
oranges.name = 'oranges'

In [11]:
apples

0    2
1    3
2    2
3    1
4    4
Name: apples, dtype: int64

In [12]:
oranges

0    1
1    2
2    2
3    3
4    2
Name: oranges, dtype: int64

In [15]:
dic = {'apples':apples,'oranges':oranges}

In [16]:
dic

{'apples': 0    2
 1    3
 2    2
 3    1
 4    4
 Name: apples, dtype: int64, 'oranges': 0    1
 1    2
 2    2
 3    3
 4    2
 Name: oranges, dtype: int64}

# pandas dataframe

In [17]:
data = pd.DataFrame(dic)

In [18]:
data

   apples  oranges
0       2        1
1       3        2
2       2        2
3       1        3
4       4        2

In [19]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [20]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [21]:
frame = pd.DataFrame(data)

In [22]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [23]:
frame = pd.DataFrame(data ,index=['First','Second','Third','Fourth','Fifth','Sixth'])

In [24]:
frame

         state  year  pop
First     Ohio  2000  1.5
Second    Ohio  2001  1.7
Third     Ohio  2002  3.6
Fourth  Nevada  2001  2.4
Fifth   Nevada  2002  2.9
Sixth   Nevada  2003  3.2

In [25]:
frame.head()

         state  year  pop
First     Ohio  2000  1.5
Second    Ohio  2001  1.7
Third     Ohio  2002  3.6
Fourth  Nevada  2001  2.4
Fifth   Nevada  2002  2.9

In [26]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [27]:
state_pop_df = pd.DataFrame(data, columns = ['year','pop','state'])

In [28]:
state_pop_df

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [29]:
state_pop_df = pd.DataFrame(data, columns = ['year','pop','state','debt'])

In [30]:
state_pop_df.head()

   year  pop   state debt
0  2000  1.5    Ohio  NaN
1  2001  1.7    Ohio  NaN
2  2002  3.6    Ohio  NaN
3  2001  2.4  Nevada  NaN
4  2002  2.9  Nevada  NaN

In [31]:
state_pop_df.columns

Index(['year', 'pop', 'state', 'debt'], dtype='object')

In [32]:
state_pop_df.index

RangeIndex(start=0, stop=6, step=1)

In [33]:
state_pop_df['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [34]:
state_pop_df['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [35]:
state_pop_df.pop

<bound method NDFrame.pop of    year  pop   state debt
0  2000  1.5    Ohio  NaN
1  2001  1.7    Ohio  NaN
2  2002  3.6    Ohio  NaN
3  2001  2.4  Nevada  NaN
4  2002  2.9  Nevada  NaN
5  2003  3.2  Nevada  NaN>

In [36]:
state_pop_df.columns

Index(['year', 'pop', 'state', 'debt'], dtype='object')

In [37]:
state_pop_df['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [38]:
state_pop_df.pop

<bound method NDFrame.pop of    year  pop   state debt
0  2000  1.5    Ohio  NaN
1  2001  1.7    Ohio  NaN
2  2002  3.6    Ohio  NaN
3  2001  2.4  Nevada  NaN
4  2002  2.9  Nevada  NaN
5  2003  3.2  Nevada  NaN>

In [39]:
state_pop_df.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [40]:
state_pop_df.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [41]:
state_pop_df.pop

<bound method NDFrame.pop of    year  pop   state debt
0  2000  1.5    Ohio  NaN
1  2001  1.7    Ohio  NaN
2  2002  3.6    Ohio  NaN
3  2001  2.4  Nevada  NaN
4  2002  2.9  Nevada  NaN
5  2003  3.2  Nevada  NaN>

In [42]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [44]:
frame

         state  year  pop
First     Ohio  2000  1.5
Second    Ohio  2001  1.7
Third     Ohio  2002  3.6
Fourth  Nevada  2001  2.4
Fifth   Nevada  2002  2.9
Sixth   Nevada  2003  3.2

In [45]:
frame.loc['First']

state    Ohio
year     2000
pop       1.5
Name: First, dtype: object

In [46]:
frame.loc[['First','Second']]

       state  year  pop
First   Ohio  2000  1.5
Second  Ohio  2001  1.7

In [47]:
frame.loc['First':'Fifth']

         state  year  pop
First     Ohio  2000  1.5
Second    Ohio  2001  1.7
Third     Ohio  2002  3.6
Fourth  Nevada  2001  2.4
Fifth   Nevada  2002  2.9

In [49]:
rang = np.arange(6)

In [50]:
frame

         state  year  pop
First     Ohio  2000  1.5
Second    Ohio  2001  1.7
Third     Ohio  2002  3.6
Fourth  Nevada  2001  2.4
Fifth   Nevada  2002  2.9
Sixth   Nevada  2003  3.2

In [52]:
frame['debt'] = rang

In [53]:
frame

         state  year  pop  debt
First     Ohio  2000  1.5     0
Second    Ohio  2001  1.7     1
Third     Ohio  2002  3.6     2
Fourth  Nevada  2001  2.4     3
Fifth   Nevada  2002  2.9     4
Sixth   Nevada  2003  3.2     5

In [55]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [56]:
frame2 = pd.DataFrame(data, columns = ['pop','year','state','debt'], index=['First','Second','Third','Fourth','Fifth','Sixth'])

In [57]:
frame

         state  year  pop  debt
First     Ohio  2000  1.5     0
Second    Ohio  2001  1.7     1
Third     Ohio  2002  3.6     2
Fourth  Nevada  2001  2.4     3
Fifth   Nevada  2002  2.9     4
Sixth   Nevada  2003  3.2     5

In [58]:
frame2

        pop  year   state debt
First   1.5  2000    Ohio  NaN
Second  1.7  2001    Ohio  NaN
Third   3.6  2002    Ohio  NaN
Fourth  2.4  2001  Nevada  NaN
Fifth   2.9  2002  Nevada  NaN
Sixth   3.2  2003  Nevada  NaN

In [59]:
frame

         state  year  pop  debt
First     Ohio  2000  1.5     0
Second    Ohio  2001  1.7     1
Third     Ohio  2002  3.6     2
Fourth  Nevada  2001  2.4     3
Fifth   Nevada  2002  2.9     4
Sixth   Nevada  2003  3.2     5

In [60]:
frame['debt'] = 2

In [61]:
frame

         state  year  pop  debt
First     Ohio  2000  1.5     2
Second    Ohio  2001  1.7     2
Third     Ohio  2002  3.6     2
Fourth  Nevada  2001  2.4     2
Fifth   Nevada  2002  2.9     2
Sixth   Nevada  2003  3.2     2

In [63]:
val = pd.Series([1,2,3,5,6,7], index=['First','Second','Third','Fourth','Fifth','Sixth'])

In [64]:
val

First     1
Second    2
Third     3
Fourth    5
Fifth     6
Sixth     7
dtype: int64

In [65]:
frame

         state  year  pop  debt
First     Ohio  2000  1.5     2
Second    Ohio  2001  1.7     2
Third     Ohio  2002  3.6     2
Fourth  Nevada  2001  2.4     2
Fifth   Nevada  2002  2.9     2
Sixth   Nevada  2003  3.2     2

In [66]:
frame['debt'] = val

In [67]:
frame

         state  year  pop  debt
First     Ohio  2000  1.5     1
Second    Ohio  2001  1.7     2
Third     Ohio  2002  3.6     3
Fourth  Nevada  2001  2.4     5
Fifth   Nevada  2002  2.9     6
Sixth   Nevada  2003  3.2     7

In [68]:
val.index

Index(['First', 'Second', 'Third', 'Fourth', 'Fifth', 'Sixth'], dtype='object')

In [69]:
val = pd.Series([1,2,3,5,6,7], index=['Zero','Second','Third','Fourth','Fifth','Sixth'])

In [70]:
frame['debt'] = val

In [71]:
frame

         state  year  pop  debt
First     Ohio  2000  1.5   NaN
Second    Ohio  2001  1.7   2.0
Third     Ohio  2002  3.6   3.0
Fourth  Nevada  2001  2.4   5.0
Fifth   Nevada  2002  2.9   6.0
Sixth   Nevada  2003  3.2   7.0

In [72]:
val2 = pd.Series([1,3,2,3,4,5])

In [73]:
frame['income'] = val2

In [74]:
frame

         state  year  pop  debt  income
First     Ohio  2000  1.5   NaN     NaN
Second    Ohio  2001  1.7   2.0     NaN
Third     Ohio  2002  3.6   3.0     NaN
Fourth  Nevada  2001  2.4   5.0     NaN
Fifth   Nevada  2002  2.9   6.0     NaN
Sixth   Nevada  2003  3.2   7.0     NaN

In [75]:
frame['income']  = 16.5

In [76]:
frame

         state  year  pop  debt  income
First     Ohio  2000  1.5   NaN    16.5
Second    Ohio  2001  1.7   2.0    16.5
Third     Ohio  2002  3.6   3.0    16.5
Fourth  Nevada  2001  2.4   5.0    16.5
Fifth   Nevada  2002  2.9   6.0    16.5
Sixth   Nevada  2003  3.2   7.0    16.5

In [77]:
frame.tail()

         state  year  pop  debt  income
Second    Ohio  2001  1.7   2.0    16.5
Third     Ohio  2002  3.6   3.0    16.5
Fourth  Nevada  2001  2.4   5.0    16.5
Fifth   Nevada  2002  2.9   6.0    16.5
Sixth   Nevada  2003  3.2   7.0    16.5

In [78]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [79]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [90]:
dic = {'ten':np.arange(10,17),'hundred':np.arange(100,107),'thousand':np.arange(1000,1007)}

In [91]:
dic

{'ten': array([10, 11, 12, 13, 14, 15, 16]),
 'hundred': array([100, 101, 102, 103, 104, 105, 106]),
 'thousand': array([1000, 1001, 1002, 1003, 1004, 1005, 1006])}

In [86]:
len(dic['ten']) == len(dic['hundred']) == len(dic['thousand'])

False

In [87]:
len(dic['ten'])

7

In [88]:
len(dic['hundred'])

7

In [89]:
len(dic['thousand'])

9007

In [92]:
len(dic['thousand'])

7

In [93]:
df = pd.DataFrame(dic)

In [94]:
df

   ten  hundred  thousand
0   10      100      1000
1   11      101      1001
2   12      102      1002
3   13      103      1003
4   14      104      1004
5   15      105      1005
6   16      106      1006

In [95]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [96]:
df

   ten  hundred  thousand
0   10      100      1000
1   11      101      1001
2   12      102      1002
3   13      103      1003
4   14      104      1004
5   15      105      1005
6   16      106      1006

In [97]:
df.head()

   ten  hundred  thousand
0   10      100      1000
1   11      101      1001
2   12      102      1002
3   13      103      1003
4   14      104      1004

In [98]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [99]:
pd.DataFrame(data, columns = ['year','pop','state'])

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [100]:
frame2

        pop  year   state debt
First   1.5  2000    Ohio  NaN
Second  1.7  2001    Ohio  NaN
Third   3.6  2002    Ohio  NaN
Fourth  2.4  2001  Nevada  NaN
Fifth   2.9  2002  Nevada  NaN
Sixth   3.2  2003  Nevada  NaN

In [101]:
frame3 = pd.DataFrame(data, columns =['year','pop','state','debt'])

In [102]:
frame3

   year  pop   state debt
0  2000  1.5    Ohio  NaN
1  2001  1.7    Ohio  NaN
2  2002  3.6    Ohio  NaN
3  2001  2.4  Nevada  NaN
4  2002  2.9  Nevada  NaN
5  2003  3.2  Nevada  NaN

In [103]:
frame3.columns

Index(['year', 'pop', 'state', 'debt'], dtype='object')

In [104]:
frame3.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [105]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [106]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [107]:
frame3['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [108]:
frame3['debt']

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
Name: debt, dtype: object

In [109]:
frame2

        pop  year   state debt
First   1.5  2000    Ohio  NaN
Second  1.7  2001    Ohio  NaN
Third   3.6  2002    Ohio  NaN
Fourth  2.4  2001  Nevada  NaN
Fifth   2.9  2002  Nevada  NaN
Sixth   3.2  2003  Nevada  NaN

In [111]:
frame2.loc['Second']

pop       1.7
year     2001
state    Ohio
debt      NaN
Name: Second, dtype: object

In [112]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [113]:
frame2

        pop  year   state debt
First   1.5  2000    Ohio  NaN
Second  1.7  2001    Ohio  NaN
Third   3.6  2002    Ohio  NaN
Fourth  2.4  2001  Nevada  NaN
Fifth   2.9  2002  Nevada  NaN
Sixth   3.2  2003  Nevada  NaN

In [114]:
frame3

   year  pop   state debt
0  2000  1.5    Ohio  NaN
1  2001  1.7    Ohio  NaN
2  2002  3.6    Ohio  NaN
3  2001  2.4  Nevada  NaN
4  2002  2.9  Nevada  NaN
5  2003  3.2  Nevada  NaN

In [115]:
frame['debt'] = 13.2

In [116]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5  13.2
1    Ohio  2001  1.7  13.2
2    Ohio  2002  3.6  13.2
3  Nevada  2001  2.4  13.2
4  Nevada  2002  2.9  13.2
5  Nevada  2003  3.2  13.2

In [117]:
frame2['debt'] = np.arange(6)

In [118]:
frame2

        pop  year   state  debt
First   1.5  2000    Ohio     0
Second  1.7  2001    Ohio     1
Third   3.6  2002    Ohio     2
Fourth  2.4  2001  Nevada     3
Fifth   2.9  2002  Nevada     4
Sixth   3.2  2003  Nevada     5

In [119]:
frame3

   year  pop   state debt
0  2000  1.5    Ohio  NaN
1  2001  1.7    Ohio  NaN
2  2002  3.6    Ohio  NaN
3  2001  2.4  Nevada  NaN
4  2002  2.9  Nevada  NaN
5  2003  3.2  Nevada  NaN

In [120]:
val = pd.Series([1.2,3.4,5.2], index=[2,4,0])

In [121]:
val

2    1.2
4    3.4
0    5.2
dtype: float64

In [122]:
frame3['debt'] = val

In [123]:
frame3

   year  pop   state  debt
0  2000  1.5    Ohio   5.2
1  2001  1.7    Ohio   NaN
2  2002  3.6    Ohio   1.2
3  2001  2.4  Nevada   NaN
4  2002  2.9  Nevada   3.4
5  2003  3.2  Nevada   NaN

In [124]:
frame3['bool'] = frame3['state'] == 'Ohio'

In [125]:
frame3

   year  pop   state  debt   bool
0  2000  1.5    Ohio   5.2   True
1  2001  1.7    Ohio   NaN   True
2  2002  3.6    Ohio   1.2   True
3  2001  2.4  Nevada   NaN  False
4  2002  2.9  Nevada   3.4  False
5  2003  3.2  Nevada   NaN  False

In [126]:
del frame3['bool']

In [127]:
frame3

   year  pop   state  debt
0  2000  1.5    Ohio   5.2
1  2001  1.7    Ohio   NaN
2  2002  3.6    Ohio   1.2
3  2001  2.4  Nevada   NaN
4  2002  2.9  Nevada   3.4
5  2003  3.2  Nevada   NaN

In [128]:
 pop = {'Nevada': {2001: 2.4, 2002: 2.9},
'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [129]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [130]:
frame4 = pd.DataFrame(pop)

In [131]:
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [132]:
frame4.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [133]:
frame3

   year  pop   state  debt
0  2000  1.5    Ohio   5.2
1  2001  1.7    Ohio   NaN
2  2002  3.6    Ohio   1.2
3  2001  2.4  Nevada   NaN
4  2002  2.9  Nevada   3.4
5  2003  3.2  Nevada   NaN

In [135]:
frame3.index.name = 'year'

In [136]:
frame3

      year  pop   state  debt
year
0     2000  1.5    Ohio   5.2
1     2001  1.7    Ohio   NaN
2     2002  3.6    Ohio   1.2
3     2001  2.4  Nevada   NaN
4     2002  2.9  Nevada   3.4
5     2003  3.2  Nevada   NaN

In [137]:
frame3.columns.name = 'state info'

In [138]:
frame3

state info  year  pop   state  debt
year
0           2000  1.5    Ohio   5.2
1           2001  1.7    Ohio   NaN
2           2002  3.6    Ohio   1.2
3           2001  2.4  Nevada   NaN
4           2002  2.9  Nevada   3.4
5           2003  3.2  Nevada   NaN

In [139]:
frame3.index.name = 'id'

In [140]:
frame3

state info  year  pop   state  debt
id
0           2000  1.5    Ohio   5.2
1           2001  1.7    Ohio   NaN
2           2002  3.6    Ohio   1.2
3           2001  2.4  Nevada   NaN
4           2002  2.9  Nevada   3.4
5           2003  3.2  Nevada   NaN

In [141]:
frame3.values

array([[2000, 1.5, 'Ohio', 5.2],
       [2001, 1.7, 'Ohio', nan],
       [2002, 3.6, 'Ohio', 1.2],
       [2001, 2.4, 'Nevada', nan],
       [2002, 2.9, 'Nevada', 3.4],
       [2003, 3.2, 'Nevada', nan]], dtype=object)

In [142]:
frame3.index

RangeIndex(start=0, stop=6, step=1, name='id')

In [143]:
series1 = pd.Series([1,2,2,4,1], name='apple')

In [144]:
series1

0    1
1    2
2    2
3    4
4    1
Name: apple, dtype: int64

In [145]:
series2 = pd.Series([2,1,3,2,3], name='orange')

In [147]:
series2

0    2
1    1
2    3
3    2
4    3
Name: orange, dtype: int64

In [148]:
fdic = {'apple':series1, 'orange':series2}

In [149]:
fdic

{'apple': 0    1
 1    2
 2    2
 3    4
 4    1
 Name: apple, dtype: int64, 'orange': 0    2
 1    1
 2    3
 3    2
 4    3
 Name: orange, dtype: int64}

In [150]:
fdf = pd.DataFrame(fdic)

In [151]:
fdf

   apple  orange
0      1       2
1      2       1
2      2       3
3      4       2
4      1       3

In [152]:
df = pd.DataFrame(np.random.randn(4,3), columns = list('ABC'), index=list('abcd'))

In [153]:
df

          A         B         C
a  0.787293  0.031017  0.990757
b  1.473006 -0.772947  0.805281
c -0.300054 -1.244248  0.099750
d -0.295352 -0.163708  0.543845

In [154]:
print(np.abs(df))

          A         B         C
a  0.787293  0.031017  0.990757
b  1.473006  0.772947  0.805281
c  0.300054  1.244248  0.099750
d  0.295352  0.163708  0.543845

In [155]:
df['B'].min()

-1.2442478676979554

In [156]:
df['B'].max()

0.031017045466607267

In [157]:
df['B'].max() - df['B'].min()

1.2752649131645626

In [158]:
f = lambda x: x.max() - x.min()

In [160]:
ds = df.apply(f)

In [161]:
ds

A    1.773060
B    1.275265
C    0.891007
dtype: float64

In [162]:
df

          A         B         C
a  0.787293  0.031017  0.990757
b  1.473006 -0.772947  0.805281
c -0.300054 -1.244248  0.099750
d -0.295352 -0.163708  0.543845

In [163]:
df['B'].sum()

-2.1498855423457193

In [164]:
marks_df = pd.DataFrame(np.arange(100,160).reshape(10,6))

In [165]:
marks_df

     0    1    2    3    4    5
0  100  101  102  103  104  105
1  106  107  108  109  110  111
2  112  113  114  115  116  117
3  118  119  120  121  122  123
4  124  125  126  127  128  129
5  130  131  132  133  134  135
6  136  137  138  139  140  141
7  142  143  144  145  146  147
8  148  149  150  151  152  153
9  154  155  156  157  158  159

In [166]:
marks_df.columns = list('ABCDEF')

In [167]:
marks_df

     A    B    C    D    E    F
0  100  101  102  103  104  105
1  106  107  108  109  110  111
2  112  113  114  115  116  117
3  118  119  120  121  122  123
4  124  125  126  127  128  129
5  130  131  132  133  134  135
6  136  137  138  139  140  141
7  142  143  144  145  146  147
8  148  149  150  151  152  153
9  154  155  156  157  158  159

In [168]:
total = lambda x: x.sum()

In [171]:
totaln = marks_df.apply(total)

In [172]:
totaln

A    1270
B    1280
C    1290
D    1300
E    1310
F    1320
dtype: int64

In [173]:
totalr = marks_df.apply(total, axis=1)

In [174]:
totalr

0    615
1    651
2    687
3    723
4    759
5    795
6    831
7    867
8    903
9    939
dtype: int64

In [175]:
marks_df['Sum'] = totalr

In [176]:
marks_df

     A    B    C    D    E    F  Sum
0  100  101  102  103  104  105  615
1  106  107  108  109  110  111  651
2  112  113  114  115  116  117  687
3  118  119  120  121  122  123  723
4  124  125  126  127  128  129  759
5  130  131  132  133  134  135  795
6  136  137  138  139  140  141  831
7  142  143  144  145  146  147  867
8  148  149  150  151  152  153  903
9  154  155  156  157  158  159  939

In [177]:
def avg(x):
    if x>900:
        return pd.Series(['A'])
    elif x>800:
        return pd.Series(['B'])
    elif x>700:
        return pd.Series(['C'])
    else:
        return pd.Series(['Satis'])

In [178]:
grade = marks_df['Sum'].apply(avg)

In [179]:
grade

       0
0  Satis
1  Satis
2  Satis
3      C
4      C
5      C
6      B
7      B
8      A
9      A

In [180]:
marks_df['Grade'] = grade

In [181]:
marks_df.head()

     A    B    C    D    E    F  Sum  Grade
0  100  101  102  103  104  105  615  Satis
1  106  107  108  109  110  111  651  Satis
2  112  113  114  115  116  117  687  Satis
3  118  119  120  121  122  123  723      C
4  124  125  126  127  128  129  759      C

In [182]:
marks_df.tail()

     A    B    C    D    E    F  Sum Grade
5  130  131  132  133  134  135  795     C
6  136  137  138  139  140  141  831     B
7  142  143  144  145  146  147  867     B
8  148  149  150  151  152  153  903     A
9  154  155  156  157  158  159  939     A

In [189]:
def mean(x):
    return pd.Series([x.sum()/6])

In [184]:
marks_df.columns

Index(['A', 'B', 'C', 'D', 'E', 'F', 'Sum', 'Grade'], dtype='object')

In [190]:
mean = marks_df[['A','B','C','D','E','F']].apply(mean, axis=1)

In [191]:
mean

       0
0  102.5
1  108.5
2  114.5
3  120.5
4  126.5
5  132.5
6  138.5
7  144.5
8  150.5
9  156.5

In [192]:
marks_df

     A    B    C    D    E    F  Sum  Grade
0  100  101  102  103  104  105  615  Satis
1  106  107  108  109  110  111  651  Satis
2  112  113  114  115  116  117  687  Satis
3  118  119  120  121  122  123  723      C
4  124  125  126  127  128  129  759      C
5  130  131  132  133  134  135  795      C
6  136  137  138  139  140  141  831      B
7  142  143  144  145  146  147  867      B
8  148  149  150  151  152  153  903      A
9  154  155  156  157  158  159  939      A

In [193]:
marks_df['Average'] = mean

In [194]:
marks_df.head()

     A    B    C    D    E    F  Sum  Grade  Average
0  100  101  102  103  104  105  615  Satis    102.5
1  106  107  108  109  110  111  651  Satis    108.5
2  112  113  114  115  116  117  687  Satis    114.5
3  118  119  120  121  122  123  723      C    120.5
4  124  125  126  127  128  129  759      C    126.5

In [195]:
df

          A         B         C
a  0.787293  0.031017  0.990757
b  1.473006 -0.772947  0.805281
c -0.300054 -1.244248  0.099750
d -0.295352 -0.163708  0.543845

In [198]:
df = pd.DataFrame(np.random.randn(4,3),columns=list('bca'), index=list('DACB'))

In [199]:
df

          b         c         a
D -0.464869 -0.189915 -0.097091
A -0.589165 -0.678654 -0.008339
C -0.061940 -0.580001 -2.469725
B  0.786942 -0.160985  1.837368

In [200]:
df.sort_index()

          b         c         a
A -0.589165 -0.678654 -0.008339
B  0.786942 -0.160985  1.837368
C -0.061940 -0.580001 -2.469725
D -0.464869 -0.189915 -0.097091

In [201]:
df.sort_index(axis=1)

          a         b         c
D -0.097091 -0.464869 -0.189915
A -0.008339 -0.589165 -0.678654
C -2.469725 -0.061940 -0.580001
B  1.837368  0.786942 -0.160985

In [202]:
df.sort_values(by='b')

          b         c         a
A -0.589165 -0.678654 -0.008339
D -0.464869 -0.189915 -0.097091
C -0.061940 -0.580001 -2.469725
B  0.786942 -0.160985  1.837368

In [203]:
df.rank()

     b    c    a
D  2.0  3.0  2.0
A  1.0  1.0  3.0
C  3.0  2.0  1.0
B  4.0  4.0  4.0

In [204]:
df.rank(ascending=True, method='min')

     b    c    a
D  2.0  3.0  2.0
A  1.0  1.0  3.0
C  3.0  2.0  1.0
B  4.0  4.0  4.0

In [205]:
df.rank(ascending=False, method='max')

     b    c    a
D  3.0  2.0  3.0
A  4.0  4.0  2.0
C  2.0  3.0  4.0
B  1.0  1.0  1.0

In [206]:
df.rank(axis='columns')

     b    c    a
D  1.0  2.0  3.0
A  2.0  1.0  3.0
C  3.0  2.0  1.0
B  2.0  1.0  3.0

In [207]:
df

          b         c         a
D -0.464869 -0.189915 -0.097091
A -0.589165 -0.678654 -0.008339
C -0.061940 -0.580001 -2.469725
B  0.786942 -0.160985  1.837368

In [209]:
df2 = pd.DataFrame(np.arange(0,20).reshape(4,5))

In [210]:
df2

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [211]:
df2.rank(ascending=True, method='min')

     0    1    2    3    4
0  1.0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  2.0  2.0
2  3.0  3.0  3.0  3.0  3.0
3  4.0  4.0  4.0  4.0  4.0

In [212]:
df2.rank(ascending = False, method='max', axis='columns')

     0    1    2    3    4
0  5.0  4.0  3.0  2.0  1.0
1  5.0  4.0  3.0  2.0  1.0
2  5.0  4.0  3.0  2.0  1.0
3  5.0  4.0  3.0  2.0  1.0

In [213]:
df2

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [214]:
df2.sum()

0    30
1    34
2    38
3    42
4    46
dtype: int64

In [215]:
df2.columns = list('ABCDE')

In [216]:
df2

    A   B   C   D   E
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [217]:
df2.sum()

A    30
B    34
C    38
D    42
E    46
dtype: int64

In [218]:
df2.sum(axis=1)

0    10
1    35
2    60
3    85
dtype: int64

In [219]:
df2.mean()

A     7.5
B     8.5
C     9.5
D    10.5
E    11.5
dtype: float64

In [221]:
df2.mean(skipna=True)

A     7.5
B     8.5
C     9.5
D    10.5
E    11.5
dtype: float64

In [222]:
df2['A'].unique()

array([ 0,  5, 10, 15], dtype=int64)

In [223]:
df2

    A   B   C   D   E
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [224]:
df2['A'].value_counts()

15    1
5     1
10    1
0     1
Name: A, dtype: int64

In [225]:
a = ['tariq']

In [226]:
a.extend(['aa'])

In [228]:
df2

    A   B   C   D   E
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [229]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5  13.2
1    Ohio  2001  1.7  13.2
2    Ohio  2002  3.6  13.2
3  Nevada  2001  2.4  13.2
4  Nevada  2002  2.9  13.2
5  Nevada  2003  3.2  13.2

In [230]:
frame.index = list('ABCDEF')

In [231]:
frame

    state  year  pop  debt
A    Ohio  2000  1.5  13.2
B    Ohio  2001  1.7  13.2
C    Ohio  2002  3.6  13.2
D  Nevada  2001  2.4  13.2
E  Nevada  2002  2.9  13.2
F  Nevada  2003  3.2  13.2

In [232]:
frame.loc['A',['pop','year']]

pop      1.5
year    2000
Name: A, dtype: object

In [233]:
frame.loc[:]

    state  year  pop  debt
A    Ohio  2000  1.5  13.2
B    Ohio  2001  1.7  13.2
C    Ohio  2002  3.6  13.2
D  Nevada  2001  2.4  13.2
E  Nevada  2002  2.9  13.2
F  Nevada  2003  3.2  13.2

In [234]:
frame.loc[['A','C'],['pop','debt','year']]

   pop  debt  year
A  1.5  13.2  2000
C  3.6  13.2  2002

In [236]:
frame.iloc[[0,2],[2,3,1]]

   pop  debt  year
A  1.5  13.2  2000
C  3.6  13.2  2002

In [238]:
frame[:]

    state  year  pop  debt
A    Ohio  2000  1.5  13.2
B    Ohio  2001  1.7  13.2
C    Ohio  2002  3.6  13.2
D  Nevada  2001  2.4  13.2
E  Nevada  2002  2.9  13.2
F  Nevada  2003  3.2  13.2

In [243]:
frame.iloc[:,:2]

    state  year
A    Ohio  2000
B    Ohio  2001
C    Ohio  2002
D  Nevada  2001
E  Nevada  2002
F  Nevada  2003

# data alignment

In [244]:
frame

    state  year  pop  debt
A    Ohio  2000  1.5  13.2
B    Ohio  2001  1.7  13.2
C    Ohio  2002  3.6  13.2
D  Nevada  2001  2.4  13.2
E  Nevada  2002  2.9  13.2
F  Nevada  2003  3.2  13.2

In [245]:
frame2

        pop  year   state  debt
First   1.5  2000    Ohio     0
Second  1.7  2001    Ohio     1
Third   3.6  2002    Ohio     2
Fourth  2.4  2001  Nevada     3
Fifth   2.9  2002  Nevada     4
Sixth   3.2  2003  Nevada     5

In [246]:
frame3

state info  year  pop   state  debt
id
0           2000  1.5    Ohio   5.2
1           2001  1.7    Ohio   NaN
2           2002  3.6    Ohio   1.2
3           2001  2.4  Nevada   NaN
4           2002  2.9  Nevada   3.4
5           2003  3.2  Nevada   NaN

In [247]:
frame2 + frame

        debt  pop state  year
A        NaN  NaN   NaN   NaN
B        NaN  NaN   NaN   NaN
C        NaN  NaN   NaN   NaN
D        NaN  NaN   NaN   NaN
E        NaN  NaN   NaN   NaN
F        NaN  NaN   NaN   NaN
Fifth    NaN  NaN   NaN   NaN
First    NaN  NaN   NaN   NaN
Fourth   NaN  NaN   NaN   NaN
Second   NaN  NaN   NaN   NaN
Sixth    NaN  NaN   NaN   NaN
Third    NaN  NaN   NaN   NaN

In [248]:
frame2.index = list('ABCDEF')

In [249]:
frame2

   pop  year   state  debt
A  1.5  2000    Ohio     0
B  1.7  2001    Ohio     1
C  3.6  2002    Ohio     2
D  2.4  2001  Nevada     3
E  2.9  2002  Nevada     4
F  3.2  2003  Nevada     5

In [250]:
frame

    state  year  pop  debt
A    Ohio  2000  1.5  13.2
B    Ohio  2001  1.7  13.2
C    Ohio  2002  3.6  13.2
D  Nevada  2001  2.4  13.2
E  Nevada  2002  2.9  13.2
F  Nevada  2003  3.2  13.2

In [251]:
frame + frame2

   debt  pop         state  year
A  13.2  3.0      OhioOhio  4000
B  14.2  3.4      OhioOhio  4002
C  15.2  7.2      OhioOhio  4004
D  16.2  4.8  NevadaNevada  4002
E  17.2  5.8  NevadaNevada  4004
F  18.2  6.4  NevadaNevada  4006

In [252]:
frame2.index = list('ABCDEG')

In [253]:
frame2

   pop  year   state  debt
A  1.5  2000    Ohio     0
B  1.7  2001    Ohio     1
C  3.6  2002    Ohio     2
D  2.4  2001  Nevada     3
E  2.9  2002  Nevada     4
G  3.2  2003  Nevada     5

In [254]:
frame2 + frame

   debt  pop         state    year
A  13.2  3.0      OhioOhio  4000.0
B  14.2  3.4      OhioOhio  4002.0
C  15.2  7.2      OhioOhio  4004.0
D  16.2  4.8  NevadaNevada  4002.0
E  17.2  5.8  NevadaNevada  4004.0
F   NaN  NaN           NaN     NaN
G   NaN  NaN           NaN     NaN

In [256]:
frame2.index = list('ABCDEF')

In [257]:
frame2

   pop  year   state  debt
A  1.5  2000    Ohio     0
B  1.7  2001    Ohio     1
C  3.6  2002    Ohio     2
D  2.4  2001  Nevada     3
E  2.9  2002  Nevada     4
F  3.2  2003  Nevada     5

In [258]:
frame

    state  year  pop  debt
A    Ohio  2000  1.5  13.2
B    Ohio  2001  1.7  13.2
C    Ohio  2002  3.6  13.2
D  Nevada  2001  2.4  13.2
E  Nevada  2002  2.9  13.2
F  Nevada  2003  3.2  13.2

In [259]:
frame2['income'] = 2.23

In [260]:
frame2

   pop  year   state  debt  income
A  1.5  2000    Ohio     0    2.23
B  1.7  2001    Ohio     1    2.23
C  3.6  2002    Ohio     2    2.23
D  2.4  2001  Nevada     3    2.23
E  2.9  2002  Nevada     4    2.23
F  3.2  2003  Nevada     5    2.23

In [261]:
frame + frame2

   debt  income  pop         state  year
A  13.2     NaN  3.0      OhioOhio  4000
B  14.2     NaN  3.4      OhioOhio  4002
C  15.2     NaN  7.2      OhioOhio  4004
D  16.2     NaN  4.8  NevadaNevada  4002
E  17.2     NaN  5.8  NevadaNevada  4004
F  18.2     NaN  6.4  NevadaNevada  4006

# arithmetic methods with fill values

In [262]:
frame

    state  year  pop  debt
A    Ohio  2000  1.5  13.2
B    Ohio  2001  1.7  13.2
C    Ohio  2002  3.6  13.2
D  Nevada  2001  2.4  13.2
E  Nevada  2002  2.9  13.2
F  Nevada  2003  3.2  13.2

In [263]:
frame2

   pop  year   state  debt  income
A  1.5  2000    Ohio     0    2.23
B  1.7  2001    Ohio     1    2.23
C  3.6  2002    Ohio     2    2.23
D  2.4  2001  Nevada     3    2.23
E  2.9  2002  Nevada     4    2.23
F  3.2  2003  Nevada     5    2.23

In [264]:
frame.add(frame2, fill_value=0)

   debt  income  pop         state  year
A  13.2    2.23  3.0      OhioOhio  4000
B  14.2    2.23  3.4      OhioOhio  4002
C  15.2    2.23  7.2      OhioOhio  4004
D  16.2    2.23  4.8  NevadaNevada  4002
E  17.2    2.23  5.8  NevadaNevada  4004
F  18.2    2.23  6.4  NevadaNevada  4006

# operations between dataframe and series

In [265]:
frame

    state  year  pop  debt
A    Ohio  2000  1.5  13.2
B    Ohio  2001  1.7  13.2
C    Ohio  2002  3.6  13.2
D  Nevada  2001  2.4  13.2
E  Nevada  2002  2.9  13.2
F  Nevada  2003  3.2  13.2

In [266]:
df

          b         c         a
D -0.464869 -0.189915 -0.097091
A -0.589165 -0.678654 -0.008339
C -0.061940 -0.580001 -2.469725
B  0.786942 -0.160985  1.837368

In [267]:
df_s = pd.DataFrame(np.arange(20).reshape(4,5))

In [268]:
df_s

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [269]:
df_s.columns = list('ABCDE')

In [270]:
df_s

    A   B   C   D   E
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [271]:
df_s.index = list('abcd')

In [272]:
df_s

    A   B   C   D   E
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

In [275]:
series_s = pd.Series([1,2,3,4], index=list('abcd'))

In [276]:
series_s

a    1
b    2
c    3
d    4
dtype: int64

In [277]:
df_s - series_s

    A   B   C   D   E   a   b   c   d
a NaN NaN NaN NaN NaN NaN NaN NaN NaN
b NaN NaN NaN NaN NaN NaN NaN NaN NaN
c NaN NaN NaN NaN NaN NaN NaN NaN NaN
d NaN NaN NaN NaN NaN NaN NaN NaN NaN

In [278]:
series_s.index = list('ABCD')

In [279]:
series_s

A    1
B    2
C    3
D    4
dtype: int64

In [280]:
df_s

    A   B   C   D   E
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

In [282]:
df_s - series_s

      A     B     C     D   E
a  -1.0  -1.0  -1.0  -1.0 NaN
b   4.0   4.0   4.0   4.0 NaN
c   9.0   9.0   9.0   9.0 NaN
d  14.0  14.0  14.0  14.0 NaN

In [283]:
series_s = pd.Series([1,2,3,4,5], index=list('ABCDE'))

In [284]:
series_s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [285]:
df_s

    A   B   C   D   E
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

In [286]:
df_s - series_s

    A   B   C   D   E
a  -1  -1  -1  -1  -1
b   4   4   4   4   4
c   9   9   9   9   9
d  14  14  14  14  14

In [287]:
series_s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [288]:
f = lambda x: x.sum()

In [289]:
df_s

    A   B   C   D   E
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

In [290]:
df_s.apply(f)

A    30
B    34
C    38
D    42
E    46
dtype: int64

In [292]:
df_s.apply(f, axis=1)

a    10
b    35
c    60
d    85
dtype: int64

In [293]:
df_s

    A   B   C   D   E
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

In [294]:
frame

    state  year  pop  debt
A    Ohio  2000  1.5  13.2
B    Ohio  2001  1.7  13.2
C    Ohio  2002  3.6  13.2
D  Nevada  2001  2.4  13.2
E  Nevada  2002  2.9  13.2
F  Nevada  2003  3.2  13.2

In [295]:
frame2

   pop  year   state  debt  income
A  1.5  2000    Ohio     0    2.23
B  1.7  2001    Ohio     1    2.23
C  3.6  2002    Ohio     2    2.23
D  2.4  2001  Nevada     3    2.23
E  2.9  2002  Nevada     4    2.23
F  3.2  2003  Nevada     5    2.23

In [296]:
frame.add(frame2, fill_value=0)

   debt  income  pop         state  year
A  13.2    2.23  3.0      OhioOhio  4000
B  14.2    2.23  3.4      OhioOhio  4002
C  15.2    2.23  7.2      OhioOhio  4004
D  16.2    2.23  4.8  NevadaNevada  4002
E  17.2    2.23  5.8  NevadaNevada  4004
F  18.2    2.23  6.4  NevadaNevada  4006

In [297]:
df_s

    A   B   C   D   E
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

In [298]:
df_s['Total'] = df_s.apply(f, axis=1)

In [299]:
df_s

    A   B   C   D   E  Total
a   0   1   2   3   4     10
b   5   6   7   8   9     35
c  10  11  12  13  14     60
d  15  16  17  18  19     85

In [300]:
df_s.index = np.arange(1,5)

In [301]:
df_s

    A   B   C   D   E  Total
1   0   1   2   3   4     10
2   5   6   7   8   9     35
3  10  11  12  13  14     60
4  15  16  17  18  19     85

In [306]:
df_s.drop('A', axis=1)

    B   C   D   E  Total
1   1   2   3   4     10
2   6   7   8   9     35
3  11  12  13  14     60
4  16  17  18  19     85

In [307]:
df_s.drop(['A','B'], axis=1)

    C   D   E  Total
1   2   3   4     10
2   7   8   9     35
3  12  13  14     60
4  17  18  19     85

In [308]:
df_s.drop([1,2], axis=0)

    A   B   C   D   E  Total
3  10  11  12  13  14     60
4  15  16  17  18  19     85

In [310]:
df_s.drop(1, axis=0)

    A   B   C   D   E  Total
2   5   6   7   8   9     35
3  10  11  12  13  14     60
4  15  16  17  18  19     85

In [311]:
df_s2 = pd.DataFrame(df_s)

In [312]:
df_s2

    A   B   C   D   E  Total
1   0   1   2   3   4     10
2   5   6   7   8   9     35
3  10  11  12  13  14     60
4  15  16  17  18  19     85

In [313]:
df_s2.drop(['A','B'],axis=1, inplace=True)

In [314]:
df_s2

    C   D   E  Total
1   2   3   4     10
2   7   8   9     35
3  12  13  14     60
4  17  18  19     85

In [315]:
df_s2.drop([1,2], axis=0, inplace=True)

In [316]:
df_s2

    C   D   E  Total
3  12  13  14     60
4  17  18  19     85

In [317]:
df_s2 = df_s2.drop(4, inplace=True)

In [318]:
df_s2

In [319]:
df_s2

In [321]:
df_s2 = pd.DataFrame(df_s)

In [322]:
df_s2

    A   B   C   D   E  Total
1   0   1   2   3   4     10
2   5   6   7   8   9     35
3  10  11  12  13  14     60
4  15  16  17  18  19     85

In [323]:
df_s.drop(4, inplace=True)

In [324]:
df_s

    A   B   C   D   E  Total
1   0   1   2   3   4     10
2   5   6   7   8   9     35
3  10  11  12  13  14     60

In [325]:
df_s.drop(3, inplace=True)

In [326]:
df_s

   A  B  C  D  E  Total
1  0  1  2  3  4     10
2  5  6  7  8  9     35

In [327]:
df_s = df_s.drop(2)

In [328]:
df_s

   A  B  C  D  E  Total
1  0  1  2  3  4     10

In [330]:
df_s

   A  B  C  D  E  Total
1  0  1  2  3  4     10

In [331]:
df_s = pd.DataFrame(df_s2)

In [332]:
df_s

    A   B   C   D   E  Total
1   0   1   2   3   4     10
2   5   6   7   8   9     35
3  10  11  12  13  14     60
4  15  16  17  18  19     85

# selection, filtering and indexing

In [333]:
df_s

    A   B   C   D   E  Total
1   0   1   2   3   4     10
2   5   6   7   8   9     35
3  10  11  12  13  14     60
4  15  16  17  18  19     85

In [334]:
df_s[:2]

   A  B  C  D  E  Total
1  0  1  2  3  4     10
2  5  6  7  8  9     35

In [336]:
df_s[::2]

    A   B   C   D   E  Total
1   0   1   2   3   4     10
3  10  11  12  13  14     60

In [337]:
df_s[2:]

    A   B   C   D   E  Total
3  10  11  12  13  14     60
4  15  16  17  18  19     85

In [339]:
df_s[['A','B','C']]

    A   B   C
1   0   1   2
2   5   6   7
3  10  11  12
4  15  16  17

In [341]:
df_s['A']

1     0
2     5
3    10
4    15
Name: A, dtype: int32

# reindex

In [342]:
sr = pd.Series(['apple','orange','strawberry'], index=[0,3,5])

In [343]:
sr

0         apple
3        orange
5    strawberry
dtype: object

In [344]:
sr.name = 'Fruits'

In [345]:
sr

0         apple
3        orange
5    strawberry
Name: Fruits, dtype: object

In [346]:
sr.reindex(range(9))

0         apple
1           NaN
2           NaN
3        orange
4           NaN
5    strawberry
6           NaN
7           NaN
8           NaN
Name: Fruits, dtype: object

In [347]:
sr

0         apple
3        orange
5    strawberry
Name: Fruits, dtype: object

In [349]:
sr = sr.reindex(range(9), method='ffill')

In [350]:
sr

0         apple
1         apple
2         apple
3        orange
4        orange
5    strawberry
6    strawberry
7    strawberry
8    strawberry
Name: Fruits, dtype: object

In [351]:
sr.reindex(range(11))

0          apple
1          apple
2          apple
3         orange
4         orange
5     strawberry
6     strawberry
7     strawberry
8     strawberry
9            NaN
10           NaN
Name: Fruits, dtype: object

In [353]:
sr = sr.reindex(range(11), method='ffill')

In [354]:
sr

0          apple
1          apple
2          apple
3         orange
4         orange
5     strawberry
6     strawberry
7     strawberry
8     strawberry
9     strawberry
10    strawberry
Name: Fruits, dtype: object

In [355]:
sn = pd.Series(['arslan','abrar','natasha','usman'], index=[0,8,12,15])

In [356]:
sn

0      arslan
8       abrar
12    natasha
15      usman
dtype: object

In [357]:
sn.reindex(range(20))

0      arslan
1         NaN
2         NaN
3         NaN
4         NaN
5         NaN
6         NaN
7         NaN
8       abrar
9         NaN
10        NaN
11        NaN
12    natasha
13        NaN
14        NaN
15      usman
16        NaN
17        NaN
18        NaN
19        NaN
dtype: object

In [358]:
sn.reindex(range(20), method='ffill')

0      arslan
1      arslan
2      arslan
3      arslan
4      arslan
5      arslan
6      arslan
7      arslan
8       abrar
9       abrar
10      abrar
11      abrar
12    natasha
13    natasha
14    natasha
15      usman
16      usman
17      usman
18      usman
19      usman
dtype: object

In [359]:
sn

0      arslan
8       abrar
12    natasha
15      usman
dtype: object

In [360]:
del sn

In [361]:
del sr

In [364]:
data = pd.DataFrame(np.random.randint(10,20, size=(4,5)))

In [365]:
data

    0   1   2   3   4
0  11  17  12  17  14
1  13  12  12  16  15
2  18  19  14  18  10
3  13  19  14  14  12

In [366]:
data.reindex(range(5))

      0     1     2     3     4
0  11.0  17.0  12.0  17.0  14.0
1  13.0  12.0  12.0  16.0  15.0
2  18.0  19.0  14.0  18.0  10.0
3  13.0  19.0  14.0  14.0  12.0
4   NaN   NaN   NaN   NaN   NaN

In [367]:
data

    0   1   2   3   4
0  11  17  12  17  14
1  13  12  12  16  15
2  18  19  14  18  10
3  13  19  14  14  12

In [368]:
data = data.reindex(range(5))

In [369]:
data

      0     1     2     3     4
0  11.0  17.0  12.0  17.0  14.0
1  13.0  12.0  12.0  16.0  15.0
2  18.0  19.0  14.0  18.0  10.0
3  13.0  19.0  14.0  14.0  12.0
4   NaN   NaN   NaN   NaN   NaN

In [371]:
data.reindex(range(5), method='ffill', axis=0)

      0     1     2     3     4
0  11.0  17.0  12.0  17.0  14.0
1  13.0  12.0  12.0  16.0  15.0
2  18.0  19.0  14.0  18.0  10.0
3  13.0  19.0  14.0  14.0  12.0
4   NaN   NaN   NaN   NaN   NaN

In [373]:
data.reindex(range(5,10), method='ffill', axis=1)

      5     6     7     8     9
0  14.0  14.0  14.0  14.0  14.0
1  15.0  15.0  15.0  15.0  15.0
2  10.0  10.0  10.0  10.0  10.0
3  12.0  12.0  12.0  12.0  12.0
4   NaN   NaN   NaN   NaN   NaN

In [374]:
data

      0     1     2     3     4
0  11.0  17.0  12.0  17.0  14.0
1  13.0  12.0  12.0  16.0  15.0
2  18.0  19.0  14.0  18.0  10.0
3  13.0  19.0  14.0  14.0  12.0
4   NaN   NaN   NaN   NaN   NaN

In [376]:
data.reindex(index=range(6), method='ffill')

      0     1     2     3     4
0  11.0  17.0  12.0  17.0  14.0
1  13.0  12.0  12.0  16.0  15.0
2  18.0  19.0  14.0  18.0  10.0
3  13.0  19.0  14.0  14.0  12.0
4   NaN   NaN   NaN   NaN   NaN
5   NaN   NaN   NaN   NaN   NaN

In [377]:
df_s

    A   B   C   D   E  Total
1   0   1   2   3   4     10
2   5   6   7   8   9     35
3  10  11  12  13  14     60
4  15  16  17  18  19     85

In [378]:
df_s.A[1:]

2     5
3    10
4    15
Name: A, dtype: int32

In [379]:
df_s.A

1     0
2     5
3    10
4    15
Name: A, dtype: int32

In [380]:
df_s['A'][1:]

2     5
3    10
4    15
Name: A, dtype: int32

In [381]:
df_s

    A   B   C   D   E  Total
1   0   1   2   3   4     10
2   5   6   7   8   9     35
3  10  11  12  13  14     60
4  15  16  17  18  19     85

In [382]:
df_s[df_s['C']>2]

    A   B   C   D   E  Total
2   5   6   7   8   9     35
3  10  11  12  13  14     60
4  15  16  17  18  19     85

In [383]:
df_s[df_s>2]

      A     B     C   D   E  Total
1   NaN   NaN   NaN   3   4     10
2   5.0   6.0   7.0   8   9     35
3  10.0  11.0  12.0  13  14     60
4  15.0  16.0  17.0  18  19     85

In [385]:
df_s.D[df_s['C']>2]

2     8
3    13
4    18
Name: D, dtype: int32

In [386]:
df_s.['C','D'][df_s['C']>2]

SyntaxError: invalid syntax (<ipython-input-386-2fc9736865b0>, line 1)

In [387]:
df_s > 2

       A      B      C     D     E  Total
1  False  False  False  True  True   True
2   True   True   True  True  True   True
3   True   True   True  True  True   True
4   True   True   True  True  True   True

In [388]:
df_s['A'] > 2

1    False
2     True
3     True
4     True
Name: A, dtype: bool

In [389]:
df_s[df_s['A']>2]

    A   B   C   D   E  Total
2   5   6   7   8   9     35
3  10  11  12  13  14     60
4  15  16  17  18  19     85

In [390]:
df_s[df_s['A']>2]

    A   B   C   D   E  Total
2   5   6   7   8   9     35
3  10  11  12  13  14     60
4  15  16  17  18  19     85

In [391]:
df_s[df_s>2]

      A     B     C   D   E  Total
1   NaN   NaN   NaN   3   4     10
2   5.0   6.0   7.0   8   9     35
3  10.0  11.0  12.0  13  14     60
4  15.0  16.0  17.0  18  19     85

In [392]:
df_s > 2

       A      B      C     D     E  Total
1  False  False  False  True  True   True
2   True   True   True  True  True   True
3   True   True   True  True  True   True
4   True   True   True  True  True   True

In [393]:
df_s['A'] > 2

1    False
2     True
3     True
4     True
Name: A, dtype: bool

In [394]:
data

      0     1     2     3     4
0  11.0  17.0  12.0  17.0  14.0
1  13.0  12.0  12.0  16.0  15.0
2  18.0  19.0  14.0  18.0  10.0
3  13.0  19.0  14.0  14.0  12.0
4   NaN   NaN   NaN   NaN   NaN

In [395]:
data.iloc[:]

      0     1     2     3     4
0  11.0  17.0  12.0  17.0  14.0
1  13.0  12.0  12.0  16.0  15.0
2  18.0  19.0  14.0  18.0  10.0
3  13.0  19.0  14.0  14.0  12.0
4   NaN   NaN   NaN   NaN   NaN

In [396]:
data.iloc[2,[0,1,2]]

0    18.0
1    19.0
2    14.0
Name: 2, dtype: float64

In [397]:
data.iloc[[1,2,0],[0,1,2]]

      0     1     2
1  13.0  12.0  12.0
2  18.0  19.0  14.0
0  11.0  17.0  12.0

In [398]:
data.iloc[:,[0,1]]

      0     1
0  11.0  17.0
1  13.0  12.0
2  18.0  19.0
3  13.0  19.0
4   NaN   NaN

In [399]:
data.iloc[:2]

      0     1     2     3     4
0  11.0  17.0  12.0  17.0  14.0
1  13.0  12.0  12.0  16.0  15.0

In [400]:
data.iloc[::2]

      0     1     2     3     4
0  11.0  17.0  12.0  17.0  14.0
2  18.0  19.0  14.0  18.0  10.0
4   NaN   NaN   NaN   NaN   NaN

In [402]:
obj = pd.Series(np.random.randn(9),index=[['a','a','a','b','b','b','c','c','c'],[1,2,3,1,2,3,1,2,3]])

In [403]:
obj

a  1   -0.766735
   2    1.596187
   3   -1.016999
b  1   -0.887478
   2    0.326518
   3   -0.528211
c  1    0.338629
   2    1.125158
   3    0.044095
dtype: float64

In [404]:
obj['a']

1   -0.766735
2    1.596187
3   -1.016999
dtype: float64

In [405]:
obj['b']

1   -0.887478
2    0.326518
3   -0.528211
dtype: float64

In [406]:
obj['c']

1    0.338629
2    1.125158
3    0.044095
dtype: float64

In [407]:
obj

a  1   -0.766735
   2    1.596187
   3   -1.016999
b  1   -0.887478
   2    0.326518
   3   -0.528211
c  1    0.338629
   2    1.125158
   3    0.044095
dtype: float64

In [408]:
obj['b':'c']

b  1   -0.887478
   2    0.326518
   3   -0.528211
c  1    0.338629
   2    1.125158
   3    0.044095
dtype: float64

In [409]:
obj[['b','c']]

b  1   -0.887478
   2    0.326518
   3   -0.528211
c  1    0.338629
   2    1.125158
   3    0.044095
dtype: float64

In [410]:
obj.loc[:]

a  1   -0.766735
   2    1.596187
   3   -1.016999
b  1   -0.887478
   2    0.326518
   3   -0.528211
c  1    0.338629
   2    1.125158
   3    0.044095
dtype: float64

In [411]:
obj.loc[:,2]

a    1.596187
b    0.326518
c    1.125158
dtype: float64

In [418]:
df = pd.DataFrame(np.arange(36).reshape(18,2),index=[['AIC','AIC','AIC','AIC','AIC','AIC',
                                                    'CNC','CNC','CNC','CNC','CNC','CNC',
                                                    'BCC','BCC','BCC','BCC','BCC','BCC',
                                                    ],[1,2,3,4,5,6,1,2,3,4,5,6,1,2,3,4,5,6,]])

In [419]:
df

        0   1
AIC 1   0   1
    2   2   3
    3   4   5
    4   6   7
    5   8   9
    6  10  11
CNC 1  12  13
    2  14  15
    3  16  17
    4  18  19
    5  20  21
    6  22  23
BCC 1  24  25
    2  26  27
    3  28  29
    4  30  31
    5  32  33
    6  34  35

In [420]:
df.unstack()

      0                       1
      1   2   3   4   5   6   1   2   3   4   5   6
AIC   0   2   4   6   8  10   1   3   5   7   9  11
BCC  24  26  28  30  32  34  25  27  29  31  33  35
CNC  12  14  16  18  20  22  13  15  17  19  21  23

In [422]:
info = pd.Series(['SAD','Accounting','Operating System','C','Visual Basic','Data Structure','DBMS','DLD'], index=[['3rd','3rd','3rd','3rd','4th','4th','4th','4th'],[1,2,3,4,1,2,3,4]])

In [423]:
info

3rd  1                 SAD
     2          Accounting
     3    Operating System
     4                   C
4th  1        Visual Basic
     2      Data Structure
     3                DBMS
     4                 DLD
dtype: object

In [426]:
info_df = info.unstack()

In [427]:
info_df

                1               2                 3    4
3rd           SAD      Accounting  Operating System    C
4th  Visual Basic  Data Structure              DBMS  DLD

In [428]:
info_df.stack()

3rd  1                 SAD
     2          Accounting
     3    Operating System
     4                   C
4th  1        Visual Basic
     2      Data Structure
     3                DBMS
     4                 DLD
dtype: object

In [429]:
hdf = pd.DataFrame(np.arange(12).reshape(4,3),
                  index=[['a','a','b','b'],[1,2,1,2]],
                  columns =[['LD','LD','BWP'],['Green','Black','Green']])

In [430]:
hdf

       LD         BWP
    Green Black Green
a 1     0     1     2
  2     3     4     5
b 1     6     7     8
  2     9    10    11

In [431]:
hdf.swaplevel()

       LD         BWP
    Green Black Green
1 a     0     1     2
2 a     3     4     5
1 b     6     7     8
2 b     9    10    11

In [432]:
hdf.swaplevel().sort_index(level=0)

       LD         BWP
    Green Black Green
1 a     0     1     2
  b     6     7     8
2 a     3     4     5
  b     9    10    11

In [438]:
df = pd.DataFrame(np.arange(16).reshape(4,4),
                 index=[['a','a','b','b'],[1,2,1,2]],
                 columns=[['First','First','Second','Second'],['Green','Black','Green','Black']])

In [439]:
df

    First       Second
    Green Black  Green Black
a 1     0     1      2     3
  2     4     5      6     7
b 1     8     9     10    11
  2    12    13     14    15

In [440]:
df.index.name = ['L1','L2']

In [441]:
df

    First       Second
    Green Black  Green Black
a 1     0     1      2     3
  2     4     5      6     7
b 1     8     9     10    11
  2    12    13     14    15

In [442]:
df.index.name

['L1', 'L2']

In [443]:
df

    First       Second
    Green Black  Green Black
a 1     0     1      2     3
  2     4     5      6     7
b 1     8     9     10    11
  2    12    13     14    15

In [444]:
df.index.names = ['L1','L2']

In [445]:
df

      First       Second
      Green Black  Green Black
L1 L2
a  1      0     1      2     3
   2      4     5      6     7
b  1      8     9     10    11
   2     12    13     14    15

In [446]:
df.columns.names = ['R1','R2']

In [447]:
df

R1    First       Second
R2    Green Black  Green Black
L1 L2
a  1      0     1      2     3
   2      4     5      6     7
b  1      8     9     10    11
   2     12    13     14    15

In [448]:
df.sum(level='L2')

R1 First       Second
R2 Green Black  Green Black
L2
1      8    10     12    14
2     16    18     20    22

In [449]:
df.sum(level='L1')

R1 First       Second
R2 Green Black  Green Black
L1
a      4     6      8    10
b     20    22     24    26

In [450]:
df

R1    First       Second
R2    Green Black  Green Black
L1 L2
a  1      0     1      2     3
   2      4     5      6     7
b  1      8     9     10    11
   2     12    13     14    15

In [451]:
df.sum(level='R2', axis=1)

R2     Green  Black
L1 L2
a  1       2      4
   2      10     12
b  1      18     20
   2      26     28

In [453]:
df1 = pd.DataFrame(np.arange(20).reshape(4,5),columns=['X','Y','Z','A','B'])
df2 = pd.DataFrame(np.arange(20).reshape(4,5),columns=['X','Y','Z','C','D'])

In [454]:
df1.merge(df2, on='X', how='inner')

    X  Y_x  Z_x   A   B  Y_y  Z_y   C   D
0   0    1    2   3   4    1    2   3   4
1   5    6    7   8   9    6    7   8   9
2  10   11   12  13  14   11   12  13  14
3  15   16   17  18  19   16   17  18  19

In [456]:
df1.merge(df2,how='inner')

    X   Y   Z   A   B   C   D
0   0   1   2   3   4   3   4
1   5   6   7   8   9   8   9
2  10  11  12  13  14  13  14
3  15  16  17  18  19  18  19

In [457]:
df

R1    First       Second
R2    Green Black  Green Black
L1 L2
a  1      0     1      2     3
   2      4     5      6     7
b  1      8     9     10    11
   2     12    13     14    15

In [458]:
df1

    X   Y   Z   A   B
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [459]:
df1.ix[:,val]

C:\Users\TARYK\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\TARYK\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

KeyError: "None of [Float64Index([1.2, 3.4, 5.2], dtype='float64')] are in the [columns]"

In [460]:
a = [1,2,3]
b= [4,5,6]
a.extend(b)

In [461]:
a

[1, 2, 3, 4, 5, 6]

In [462]:
a.append(b)

In [463]:
a

[1, 2, 3, 4, 5, 6, [4, 5, 6]]